[
  {
    "name": "SkyUI",
    "summary": "Elegant, PC-friendly interface mod with many advanced features.",
    "description": "[b]This is an unsupported alpha version for testing. Use at your own risk.[/b]\r<br />\r<br />Version 5.2SE - Requires SKSE64 2.0.4 alpha or newer and and Skyrim 1.5.3.\r<br />\r<br />Version 5.1SE - Requires SKSE64 2.0.2 alpha or newer and and Skyrim 1.4.2.",
    "picture_url": "https://staticdelivery.nexusmods.com/mods/1704/images/12604-0-1506820354.png",
    "mod_id": 12604,
    "game_id": 1704,
    "allow_rating": true,
    "domain_name": "skyrimspecialedition",
    "category_id": 42,
    "version": "5.2SE",
    "endorsement_count": 131430,
    "created_timestamp": 1506858943,
    "created_time": "2017-10-01T11:55:43.000+00:00",
    "updated_timestamp": 1507064606,
    "updated_time": "2017-10-03T21:03:26.000+00:00",
    "author": "SkyUI Team",
    "uploaded_by": "schlangster",
    "uploaded_users_profile_url": "http://www.nexusmods.com/games/users/28794",
    "contains_adult_content": false,
    "status": "published",
    "available": true,
    "user": {
      "member_id": 28794,
      "member_group_id": 30,
      "name": "schlangster"
    },
    "endorsement": null
  },
  {
    "name": "Mod Organizer 2",
    "summary": "Mod Organizer (MO) is a tool for managing mod collections of arbitrary size. It is specifically designed for people who like to experiment with mods and thus need an easy and reliable way to install and uninstall them.",
    "description": "[b][size=6][center][/center][/size][/b][center][b][size=6][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525725847-1091249355.png[/img]﻿\n<br />[/size][/b][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1563224794-626109300.png[/img]﻿\n<br />\n<br />[i][size=3][/size][/i][/center][center][size=3][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525902599-531374932.png[/img]﻿﻿\n<br />[/size]\n<br />\n<br />[url=https://www.youtube.com/watch?v=DG3eqyNOByw&amp;list=PLlN8weLk86Xh3ue76x2ibqtmMramwQmHB]OFFICIAL MOD ORGANIZER 2 GUIDE BY GAMERPOETS[/url]﻿\n<br />\n<br />[youtube]DG3eqyNOByw[/youtube][i]﻿[/i][/center]\n<br />\n<br />\n<br />[size=3]Mod Organizer 2 is a mod manager created by Tannin to support 64bit games like Skyrim Special Edition and Fallout 4 in addition to all the 32bit games MO1 already supported.\n<br />Tannin discontinued the project when he was hired by the Nexus team to develop their new Vortex mod manager.\n<br />MO2 was not completed and was left with many issues. LePresidente managed to fix it to a usable state by himself after SkyrimSE came out, adding support for it, and releasing v2.0.8.\n<br />The project took up speed again after a few more coders showed up in late 2017, and an incredible amount of work has been done!\n<br />\n<br />Credits to Tannin, LePresidente, Silarn, erasmux, AL12, LostDragonist, isa, AnyOldName3, Holt59 and many others for the development.\n<br />\n<br />A Special Thanks to all the testers of the discord server and everyone else involved for supporting the project!\n<br />\n<br />[b]MO2 Team:\n<br />[/b][spoiler]\n<br />\n<br />[u]Lead Developers:[/u]\n<br />Lepresidente\n<br />Silarn\n<br />erasmux\n<br />AL12\n<br />LostDragonist\n<br />isa\n<br />\n<br />[u]Developers:\n<br />[/u]bshd // przester \n<br />AnyOldName3\n<br />Holt59\n<br />Project567\n<br />Deorder\n<br />\n<br />[u]Community Manager:[/u]\n<br />outdatedtv // ponurymazepa\n<br />\n<br />[u]MO1 Legacy dev:\n<br />[/u]Nyreen Kandros // enpinion\n<br />\n<br />[b]Contact: [url=https://discord.gg/5tCqt6V]Mod Organizer 2 Dev Discord[/url][/b]\n<br />\n<br />[/spoiler][/size]\n<br />\n<br />[size=5][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731336-1721744283.png[/img]﻿[/center][/b][/size][size=3][b][b]Mod Organizer v2.2.2 has been released, see the logs section for all the changes.\n<br />[url=https://github.com/Modorganizer2/modorganizer/wiki/Mod-Organizer-2-Changelog]Mod Organizer 2 Full Changelog[/url][/b][/b]\n<br />\n<br />Attention! The new version requires the newest Visual C++ 2019 redists installed: [url=https://aka.ms/vs/16/release/vc_redist.x64.exe]https://aka.ms/vs/16/release/vc_redist.x64.exe[/url]\n<br />\n<br />[b]Mod organizer 1 Legacy (thanks enpinion):[/b]\n<br />[Spoiler]\n<br />Recently Nexus changed their services to be compliant to the new EU rules. These changes required programs making use of them (such as MO1, NMM and MO2) to be updated to be able to still use Nexus integrations.\n<br />Even though MO1 is End of Life and will not get any future updates, enpinion managed to get the Mo1 code to build and has been able to fix this issue. We discussed with Tannin (original creator of MO1 and Mo2) and decided to host here the fixed Legacy version. This does not mean that Mo1 will receive any further updates, or that it is supported in any way. The Mo2 team will continue to work on Mo2 and strive to make it the better program.\n<br />\n<br />Link to the Mo1 source code: [url=http://git.soundcontact.studio/MO1/ModOrganizer]http://git.soundcontact.studio/MO1/ModOrganizer\n<br />[/url]Mod Organizer 1 original page: [url=https://www.nexusmods.com/skyrim/mods/1334]https://www.nexusmods.com/skyrim/mods/1334[/url]\n<br />\n<br />Mo1.3.15 changelog:\n<br />[Spoiler]\n<br />Mod Organizer 1.3.12\n<br />--------------\n<br />* Updated to Nexus' download URI\n<br />* Updated to Qt 5.4.2\n<br />\n<br />Mod Organizer 1.3.13\n<br />-------------\n<br />* SSL/TLS function is implemented (to support https).\n<br />\n<br />Mod Organizer 1.3.14\n<br />-------------\n<br />* Download over CDN and an alternative method to get query metadata is added\n<br />* Error #299 caused by Nexus incorrect file content header is now patched. Thanks to the Mod Organizer 2 team for diagnosing the problem.\n<br />\n<br />Mod Organizer 1.3.15\n<br />* EU#1 Download server workaround applied.\n<br />* Default tab is restored.\n<br />\n<br />Known Issues:\n<br />---------------------\n<br />* All MO1.3.11 known issues.\n<br />* Download from Nexus can still give errors due to Nexus Server problems (they have been informed and are investigating), specifically the #EU1 server seems to not return the correct download urls. A workaround is selecting the CDN server (which now is able to provide Premium services) as the favourite server in the MO settings. If this still doesn't work you should try setting another server (different from EU1) instead.\n<br />* UI is not DPIAware. It's well known bug for old Qt-based application.\n<br />\n<br />Library Details:\n<br />OpenSSL-1.0.2o\n<br />Sip: 4.16.9\n<br />zlib: 1.2.11\n<br />icu: 53\n<br />[/Spoiler]\n<br />Credits go to enpinion for the fixes and Tannin for the program.\n<br />[/Spoiler][/size]\n<br />\n<br />[size=5][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731336-172706663.png[/img]﻿[/center][/b][/size][size=3]Mod Organizer 2 is an open project in the hands of the community, there are problems that need to be solved and things that could be added. MO2 really needs developers and if you have the programming skills and some free time you can really improve the experience of the modding community.\n<br />[Spoiler]\n<br />To have more information please join the open MO2 Development discord server : [url=https://discord.gg/5tCqt6V]ModOrganizerDevs[/url]\n<br />You can find the MO2 code here:[url=https://github.com/Modorganizer2] https://github.com/Modorganizer2[/url]\n<br />It's subdivided into many repositories that can be found under the Modorganizer2 GiitHub organization repositories.\n<br />To build and setup a development environment on your machine of MO2 there is an umbrella project that handles it. [url=https://github.com/Modorganizer2/modorganizer-umbrella]Here are the instructions to setup a dev environment.[/url]﻿\n<br />If you want to help translate MO2 to your language you should join the discord server too and head to the #translation channel.\n<br />\n<br />Through the work of a few people of the community MO2 has come quite far, now it needs some more of those people to go further. (literally things will not get fixed if no one shows up to fix them)\n<br />\n<br />\n<br />MO2 survived because people spontaneously offered their help where they could, no one forces them to continue spending their limited free time on the project.\n<br />So nothing is to be expected, everything is to be thanked for. \n<br />[/Spoiler]\n<br />[/size][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731346-57178329.png[/img]﻿[/center][/b][size=3][b]Short Version:\n<br />\n<br />[/b]Mod Organizer 2 (MO2) is a feature rich Mod Manager.\n<br />MO2 is very advanced and specialized for Bethesda games. Here is the list of supported titles:\n<br />\n<br />[spoiler][list]\n<br />[*][size=3] Morrowind[/size]\n<br />[*][size=3] Oblivion(*)[/size]\n<br />[*][size=3] Fallout 3[/size]\n<br />[*][size=3] Fallout NV[/size]\n<br />[*][size=3] Tale of Two Wastelands (TTW)[/size]\n<br />[*][size=3] Skyrim[/size]\n<br />[*][size=3] Skyrim SE[/size]\n<br />[*][size=3] Skyrim VR [/size]\n<br />[*][size=3] Fallout 4[/size]\n<br />[*][size=3] Fallout 4 VR[/size]\n<br />[*][size=3] Enderal (Steam Edition)[/size]\n<br />[/list][size=3](*)To use OBSE with Mo2 you need to follow these [url=https://github.com/ModOrganizer2/modorganizer/wiki/Running-Oblivion-OBSE-with-MO2]steps [/url]as otherwise you can't load it.\n<br />[/size][/spoiler]\n<br />\n<br />What distinguishes MO2 from more traditional mod managers is the idea of not modifying the \"vanilla\" game installation in any way. Mods are not actually installed in the game folder but instead are kept each in their own separate folders. The game INI configuration files are not touched and instead MO2 uses it's own set.\n<br /> This way mods are only \"active\" if the game is started from MO2, while if it's started normally it will be in it's \"vanilla\" unmodded state.\n<br />\n<br />What this means for users is that enabling/disabling mods doesn't actually require any file transfers, it can be done instantly. The order in which mods are \"installed\" can also be modified at any moment with drag &amp; drop, easily changing which mods are winning file conflicts.\n<br />\n<br />Users can change the entire setup with a couple of click by using different Profiles of enabled mods. Each profile has it's own order of mods and plugins and even it's own set of INI files, different from the ones in MyGames which are left untouched.\n<br />\n<br />Users should change INI settings from within MO2 by using the integrated INI Editor. If they need some other program to also see the installed mods, they can add it to the list of executables and start it from MO2, so that the mods may be shown.\n<br />\n<br />[b]Long Version:[/b]\n<br />\n<br />Mod Organizer (MO) is a tool for managing mod collections of arbitrary size. It is specifically designed for people who like to experiment with mods and thus need an easy and reliable way to install and uninstall them.\n<br />\n<br />The special fact about MO2 is that it uses a Virtual File System (VFS) instead of actually installing your mods into the Data folder of the game.\n<br />MO2 uses it's VFS to trick the game and other programs into thinking that the mods are installed in the data folder while they are actually installed in their own separated folders. This VFS is called USVFS (User Space VFS), which is different from the VFS that MO1 used, since the old one did not support 64bit programs, but it works on a similar concept. \n<br />[b]Which means that only programs started through MO2 will see the mods, while for the rest of the world the game will remain vanilla.\n<br />[/b]\n<br />The VFS works by hooking the target program (and any of it's children processes), intercepting all the requests of accessing files and folders, if those are referred to the game Data folder then usvfs will intervene and change the answer so that it looks to the program like all the Mods files are located there as well (this kind of behavior is similar to how some types of malware behave and that is why some Antivirus will flag usvfs badly). \n<br />This system allows for a process specific virtual folder that does not take up space and can be interacted with without having to actually move or copy any files. \n<br />\n<br />The implementation of usvfs is quite complex and low level as it goes and hooks Windows API calls, keeping a shared record across hooked process of the changes such as added files and deleted ones in real time. \n<br />Usvfs is a standalone library that is meant to be usable in different applications other than MO2, as such it does not contain MO specific code like the MO1 VFS did (hook.dll).\n<br />\n<br />Differences with Mod Organizer 1:\n<br />\n<br />MO1 and Mo2 can be considered different programs. The main difference between the two is that the virtual file system (vfs) used by Mo1 does did not support 64bit games. Because of this MO2 has a completely new vfs library (called usvfs) that was made to support 64bit programs as well. This library is more separate and independent from the rest of the program allowing for it to be potentially used even by other programs.\n<br />\n<br />Another major difference is that Mo1 had a special system to manage Bethesda Archives (BSAs). \n<br />Tannin (the creator of both MO1 and MO2) decided to not include this feature in MO2 for the fact that it subverted how the the game actually loaded the Archives causing problems with tools and mods that relied on the original system to work. That in addition to the sheer complexity of implementing the feature with the new virtualization library and making it work with all the supported games (the Mo1 system was based on a hack). \n<br />From his experience and all the problems he had with Mo1, Tannin came to the conclusion that using a special system for BSA management that did not follow what the game did was a mistake.\n<br />We agree on that fact, having seen the problems it caused and compromises that the feature would have required. \n<br />\n<br />We are working though in restoring BSA (and all other typs of Archives like BA2) parsing for conflict detection. This time it will follow the standard game rules, which are:\n<br />All Archives are loaded in the order of the plugins loading them (in Mo2 you can't disable dummy plugins), and after that all loose assets are loaded on top. So loose assets can't be overwritten by archives.\n<br />We are looking for the best ways to visually show the conflicts of BSAs as they don't follow left pane order anymore, but right pane instead.\n<br />We will be looking into ways to not use dummy plugins to load BSAs in the future.\n<br />\n<br />MO2 is of course receiving active development from the community while Mo1 does not, which means that there are and will be new features in MO2.\n<br />Listing everything here would be too long so to have a better idea of all the things that Mo2 adds you are invited to read the Changelogs that you can find under the LOGS tab.\n<br />\n<br />Here is the list of all the games currently supported by MO2:\n<br />\n<br />[/size][list]\n<br />[*][size=3] Morrowind[/size]\n<br />[*][size=3] Oblivion(*)[/size]\n<br />[*][size=3] Fallout 3[/size]\n<br />[*][size=3] Fallout NV[/size]\n<br />[*][size=3] Tale of Two Wastelands (TTW)[/size]\n<br />[*][size=3] Skyrim[/size]\n<br />[*][size=3] Skyrim SE[/size]\n<br />[*][size=3] Skyrim VR [/size]\n<br />[*][size=3] Fallout 4[/size]\n<br />[*][size=3] Fallout 4 VR[/size]\n<br />[*][size=3] Enderal (Steam Edition)[/size]\n<br />[/list][size=3](*)To use OBSE with Mo2 you need to follow these [url=https://github.com/ModOrganizer2/modorganizer/wiki/Running-Oblivion-OBSE-with-MO2]steps [/url]as otherwise you can't load it.[/size]\n<br />\n<br />[size=5][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731346-880429556.png[/img]﻿[/center][/b][/size]\n<br />[size=3][spoiler]\n<br />[b][center]MAIN FEATURES[/center][/b]\n<br />MO has several unique features not found in any other comparable tool:\n<br />\n<br />[/size][list]\n<br />[*][size=3]Mods are kept completely isolated from each other -&gt; no more messy data directory (1)[/size]\n<br />[*][size=3]Profiles (2)[/size]\n<br />[*][size=3]Drag &amp; drop load order AND installation order management[/size]\n<br />[*][size=3][s]full control over the priority of BSA files (3)[/s] (feature under evaluation)[/size]\n<br />[*][size=3]Nexus integration for easy download, installation and update of mods[/size]\n<br />[*][size=3]GUI support for manual installers[/size]\n<br />[*][size=3]Partial compatibility with BAIN and fomod installers[/size]\n<br />[*][size=3]Savegame viewer[/size]\n<br />[*][size=3]Activate required plugins from save game data[/size]\n<br />[*][size=3]Archive Invalidation[/size]\n<br />[*][size=3]Archive Extraction[/size]\n<br />[*][size=3]Limited file preview (text, textures)[/size]\n<br />[*][size=3]Categorize mods for better overview (customizable)[/size]\n<br />[*][size=3]Easy overview of file conflicts[/size]\n<br />[*][size=3]Help and tutorial system[/size]\n<br />[*][size=3]Manage multiple game instances from the same install[/size]\n<br />[*][size=3]Supports [b]Morrowind[/b], [b]Oblivion[/b], [b]Fallout 3[/b], [b]Fallout NV[/b], [b]Tale of Two Wastelands (TTW)[/b], [b]Skyrim[/b], [b]Skyrim SE[/b], [b]Skyrim VR[/b], [b]Fallout 4[/b], and [b]Fallout 4 VR[/b][/size]\n<br />[*][size=3]Installer handles minimal dependencies. Standalone requires the MSVC 2019 redistributables.[/size]\n<br />[*][size=3]Localization in the works (by completeness)[/size]\n<br />[list][*][b][size=3]In Release:[/size][/b]\n<br />[*][i][size=3]Complete or nearly complete[/size][/i]\n<br />[list][*][size=3]Spanish[/size]\n<br />[*][size=3]Portuguese (Brazil)[/size]\n<br />[*][size=3]French[/size]\n<br />[*][size=3]Dutch[/size]\n<br />[*][size=3]Polish[/size]\n<br />[/list][*][i][size=3]Mostly complete (included in the release)[/size][/i]\n<br />[list]\n<br />[*][size=3]Chinese[/size]\n<br />[*][size=3]Italian[/size]\n<br />[*][size=3]German[/size]\n<br />[/list][*][b][size=3]Not In Release:[/size][/b]\n<br />[*][i][size=3]Stalled[/size][/i]\n<br />[list]\n<br />[*][size=3]Russian[/size]\n<br />[*][size=3]Korean[/size]\n<br />[*][size=3]Chinese (Taiwan)[/size]\n<br />[*][size=3]Japanese[/size]\n<br />[/list][*][i][size=3]Minimal (translators needed)[/size][/i]\n<br />[list]\n<br />[*][size=3]Hungarian[/size]\n<br />[*][size=3]Finnish[/size]\n<br />[*][size=3]Czech[/size]\n<br />[*][size=3]Swedish[/size]\n<br />[*][size=3]Romanian[/size]\n<br />[*][size=3]Turkish[/size]\n<br />[/list][/list][*][size=3]Automatic self-updates[/size]\n<br />[/list][size=3]\n<br />[/size]\n<br />[b][size=4][center]MOD ISOLATION[/center][/size][/b]\n<br />[size=3]What mod isolation means is that each mod is installed into its own directory outside the actual data directory.\n<br />Through some magic MO then shows the game (and any other 3rd party tool that works on the data directory) a \"virtual\"\n<br />data directory that is a merger of the actual data directory and all the mod directories.\n<br />This way no file ever get overwritten when you install a mod and your data directory can remain in a vanilla state.\n<br />You can simply change the \"installation order\" of mods from the gui and deinstall or temporarily deactivate one\n<br />without breaking other mods.\n<br />[/size]\n<br />\n<br />[b][size=4][center]PROFILES[/center][/size][/b]\n<br />[size=3]With MO2, you can have different mods active in different playthroughs. You can consider the installed mods as a pool of mods, and for each profile you can have a different set of them active. Disabled mods will not be visible to the game; as far as the game is concerned, they are not there at all.\n<br />\n<br />Saves (along with their script extender counterparts) can be transferred or copied character-by-character inside of a profile (and back out), and you can then load only those profile saves in the game.\n<br />\n<br />You can also copy in an individual settings file into the profile, and these settings will be unique to that profile. The settings can also be independently edited inside MO or via tools run through MO. (The settings files will appear to be in their standard location when edited this way.)\n<br />\n<br />(This feature was removed from MO2 by Tannin and is pending review)\n<br />[/size]\n<br />\n<br />[b][s][size=3][center]BSA PRIORITY[/center][/size][/s][/b][size=1][center](This feature was removed from MO2 by Tannin and is pending review)[/center][/size]\n<br />[s]BSA files are archives that contain assets like textures, meshes, sounds, scripts, ...\n<br />All vanilla data resides in BSAs and by default, the Skyrim Creation Kit packages assets for mods in BSAs. Traditionally you can not control priority between BSAs and \"loose\" files (that is: assets that came as individual files), BSAs are always overwritten. Therefore, if you wanted to use files from a BSA over files from a mod that came as \"loose\" files, you'd have to figure out and delete the correct files manually.\n<br />\n<br />MO fixes this problems and afaik it is the only tool available to do so. In the UI, check all BSAs you want loaded and you're ready to go. Files from BSAs have priority according to their installation order (left pane) -&gt; They overwrite files from mods with lower priorities and don't overwrite files with higher priority. The limit of enables BSAs is approx 8000)[/s]\n<br />\n<br />\n<br />[center][b][size=4]VIRTUAL FILE SYSTEM[/size][/b][/center][size=3]\n<br />To work its magic, a part of MO needs to be active while the game is running. To achieve this, you can start the game from the MO User Interface. The GUI also offers the option to create shortcuts that will activate a minimal MO instance (basically just a dialog box) and immediately run the game (or related tools). If you want a tool to see the mods, add it as an executable to MO2.\n<br />\n<br />\n<br />[b]For Oblivion (all versions) players: [/b]To allow MO2 to load OBSE correctly you need to follow [url=https://github.com/ModOrganizer2/modorganizer/wiki/Running-Oblivion-OBSE-with-MO2]these steps[/url].[/spoiler]\n<br />[/size]\n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1526063040-85868289.png[/img]﻿[/center]\n<br />[size=3]Mod Organizer 2 supports third party plugins!\n<br />[Spoiler]\n<br />These work simply by being placed in the Plugins folder in the Mo2 install location. Mo2 offers plugin management though its settings menu.\n<br />\n<br />You can write your own C++ and now even Python plugins (thanks to the work of AnyOldName3) to add functionalities to MO2, the Python ones being particularly interesting since they don't need you to compile any code as you can simply drop the .py file in the plugins folder.\n<br />\n<br />Mo2 already uses plugins for many parts of the current functionalities (supported games are plugins, the BSA extractor is a plugin, the texture preview is a plugin etc...).\n<br />Your third party plugins can be distributed on Nexus or GitHub or wherever you prefer. If they work well and could be useful for a good amount of users, we would be happy to consider incorporating them in the main Mo2 release under your request.\n<br />\n<br />Here you can find more info on writing your own Mo2 plugins:\n<br />[url=https://github.com/Modorganizer2/modorganizer/wiki/Writing-Mod-Organizer-Plugins]https://github.com/Modorganizer2/modorganizer/wiki/Writing-Mod-Organizer-Plugins\n<br />[/url]Looking at existing plugins might be the best way to learn so we will list here the existing Mo2 plugins for reference.\n<br />\n<br />List of the known MO2 Third Party Plugins :\n<br />[spoiler]\n<br />\n<br />Mod Organizer - Orphaned script extender save deleter plugin:\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/17082]https://www.nexusmods.com/skyrimspecialedition/mods/17082[/url]﻿\n<br />\n<br />ModOrganizer-to-OpenMW:\n<br />[url=https://www.nexusmods.com/morrowind/mods/45642]https://www.nexusmods.com/morrowind/mods/45642[/url]\n<br />\n<br />Mod Organizer - Merge Plugins Hide: Hide / unhide plugins that were merged using Merge Plugins:\n<br />[url=https://github.com/deorder/mo2-plugins]https://github.com/deorder/mo2-plugins[/url]\n<br />\n<br />Sync Mod Order: Sync mod order from current profile to another while keeping the (enabled/disabled) state intact:\n<br />[url=https://github.com/deorder/mo2-plugins]https://github.com/deorder/mo2-plugins[/url]﻿\n<br />\n<br />Fix Game Registry Key: Helps ensure your registry is correct when launching applications\n<br />[url=https://www.nexusmods.com/site/mods/82]https://www.nexusmods.com/site/mods/82[/url]\n<br />\n<br />Game Redirector: Redirects game files between games to improve tool compatibility (e.g., Enderal and Skyrim tools)\n<br />[url=https://www.nexusmods.com/site/mods/82]https://www.nexusmods.com/site/mods/82[/url]\n<br />\n<br />[/spoiler]\n<br />List of all the Plugins that are integrated in the MO2 release:\n<br />[spoiler]\n<br />[url=https://github.com/Modorganizer2/modorganizer-bsa_extractor]https://github.com/Modorganizer2/modorganizer-bsa_extractor[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-check_fnis]https://github.com/Modorganizer2/modorganizer-check_fnis[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-diagnose_basic]https://github.com/Modorganizer2/modorganizer-diagnose_basic[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_fallout3]https://github.com/Modorganizer2/modorganizer-game_fallout3[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_fallout4]https://github.com/Modorganizer2/modorganizer-game_fallout4[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_fallout4vr]https://github.com/Modorganizer2/modorganizer-game_fallout4vr[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_falloutnv]https://github.com/Modorganizer2/modorganizer-game_falloutnv[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_features]https://github.com/Modorganizer2/modorganizer-game_features[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_gamebryo]https://github.com/Modorganizer2/modorganizer-game_gamebryo[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_morrowind]https://github.com/Modorganizer2/modorganizer-game_morrowind[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_oblivion]https://github.com/Modorganizer2/modorganizer-game_oblivion[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_skyrim]https://github.com/Modorganizer2/modorganizer-game_skyrim[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_skyrimSE]https://github.com/Modorganizer2/modorganizer-game_skyrimSE[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-game_ttw]https://github.com/Modorganizer2/modorganizer-game_ttw[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-installer_bain]https://github.com/Modorganizer2/modorganizer-installer_bain[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-installer_bundle]https://github.com/Modorganizer2/modorganizer-installer_bundle[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-installer_fomod]https://github.com/Modorganizer2/modorganizer-installer_fomod[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-installer_manual]https://github.com/Modorganizer2/modorganizer-installer_manual[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-installer_ncc]https://github.com/Modorganizer2/modorganizer-installer_ncc[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-installer_quick]https://github.com/Modorganizer2/modorganizer-installer_quick[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-preview_base]https://github.com/Modorganizer2/modorganizer-preview_base[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-tool_configurator]https://github.com/Modorganizer2/modorganizer-tool_configurator[/url]\n<br />[url=https://github.com/Modorganizer2/modorganizer-tool_inibakery]https://github.com/Modorganizer2/modorganizer-tool_inibakery[/url]\n<br />[/spoiler]\n<br />\n<br />Contact us though the discord server: [url=https://discord.gg/5tCqt6V]https://discord.gg/5tCqt6V[/url] if you want to know more about creating plugins or if you want your third party plugins to be listed on the Mo2 page.\n<br />[/Spoiler][/size]\n<br />\n<br />[size=5][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731368-167965123.png[/img]﻿[/center][/b][/size][size=3][Spoiler][center]\n<br />[youtube]ruq6hQIAvB8[/youtube][/center]Mod Organizer 2 should not be installed inside a system protected folder such as Programs Files (x86). \n<br />Also avoid installing MO2 inside the Game folder as this causes problems with the vfs library.\n<br />Mo2 is a 64bit application and as such it requires a 64bit operating system to run.\n<br />\n<br />[b]Installer:\n<br />[/b]Simplest for non-portable instanced installations, using the installer should be as simple as downloading and running the exe and specifying your install directory. It will download and install all necessary components required to run MO2.\n<br />\n<br />If you want to update an existing Mo2 install using the installer, simply select your current MO2 folder as the install location and the installer will take care of the rest without endangering your modded setup.\n<br />\n<br />As Windows tends to trust installer files better than manually extracted files, using the installer may provide a more problem-free experience.\n<br />\n<br />[b]Archive:[/b]\n<br />Often ideal for portable installations, simply extract MO2 to a new location for each game you wish to manage. It can still be used for instanced installs.\n<br />\n<br />Before unpacking the Mod Organizer 2 zip, make sure to open the properties and hit 'Unblock' if it shows up. If you don't do this then various libraries may fail to load or run when trying to use Mod Organizer. This can break certain installers or the virtualization system altogether.\n<br />\n<br />If you wish to update an existing Mo2 installation it is generally a good idea to make a clean upgrade following these instructions:\n<br />1. Go to your MO2 installation directory, delete all directories and files EXCEPT for &#92;downloads, &#92;mods, &#92;profiles, &#92;overwrite, ModOrganizer.ini and categories.dat (leave those dirs and files, delete the rest).\n<br />2. Extract the new version to this location.\n<br />3. Start MO2.\n<br />\n<br />[b]Requirements:[/b]\n<br />Mod Organizer 2 depends on the MSVC 2019 runtime library. You must download and install this for MO2 to work properly (in addition to the extra steps written above). Download and install the x64 versions of the 2019 redistributable: \n<br />[url=https://support.microsoft.com/en-us/help/2977003/the-latest-supported-visual-c-downloads]VC redist x64[/url]﻿[url=https://aka.ms/vs/15/release/VC_redist.x86.exe]\n<br />[/url]If you are not on Win10 you might also need:\n<br />[url=https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows]https://support.microsoft.com/en-us/help/2999226/update-for-universal-c-runtime-in-windows\n<br />[/url]The installer version should automatically handle this step for you.\n<br />\n<br />[b]Note:[/b]\n<br />Once installed, make sure the MO2 directory and/or files are excluded from any antivirus you may have installed. MO2's virtualization system hooks into the running applications and modifies system calls, and many antiviruses do not like this.\n<br />\n<br />[b]Migrating from Mod Organizer 1:\n<br />[/b]GamerPoets covered this in this video of his official MO2 guide (that we highly recommend):\n<br />[url=https://www.youtube.com/watch?v=utNBS4LflIc]https://www.youtube.com/watch?v=utNBS4LflIc\n<br />[/url][/Spoiler][/size]\n<br />[size=5][b][center][/center][/b][/size]\n<br />[size=5][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731420-121408984.png[/img]﻿[/center][/b][/size][size=3]Mo2 is a 64bit application and as such it requires a 64bit operating system to run.\n<br />Mod Organizer 2 works with the vast majority of tools. What this means is that they can be made to work on the \"virtual\" data tree.\n<br />Among the tested applications are: OBMM (though OMOD scripts may not compile properly), FOMM, MLOX, LOOT, Wrye Bash, FNIS, xEdit, DynDOLOD... and many more.\n<br />\n<br />If you find an application that does not work, please report it to us.\n<br />[/size]\n<br />[size=5][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731435-880375973.png[/img]﻿[/center][/b][/size]\n<br />[spoiler]\n<br />[size=2]Q: When I run a program through MO2 it does not see the mods I have installed!\n<br />A: The first thing to try is to reboot the PC by using the \"restart\" option (shutdown+start does not fix it), this will fix issues caused by cleaning programs such as CCleaner removing the Windows Event Logs, which in turn will break the VFS, for this reason you should refrain from cleaning those.\n<br />If the reboot did not fix it then there is a very good chance your Antivirus is blocking the VFS. To see if this is the case temporarily disable the Real Time protection of your AV and reinstall MO2 (to make sure the AV has not deleted some). If this still does not work then you should check this troubleshooting wiki:\n<br />[/size][size=3] [url=https://github.com/ModOrganizer2/modorganizer/wiki/Troubleshooting]Trouble[/url][/size][size=3][url=https://github.com/ModOrganizer2/modorganizer/wiki/Troubleshooting]shooting[/url][/size]\n<br />[size=2]In case that does not work either you should try joining the MO2 dev server and explain the issue, the other users and developers will try to help solving the issue.[/size]\n<br />\n<br />Q: I installed a mod and it's not working!\n<br />A: Please first verify that the directory structure is correct. Many mods are not packaged for easy installation. The files in the MO mod directory should match the files that go into the Data directory in your game. You may have to shift files around. Mods not showing up in game could also be an indication that your MO2 files are being blocked by Windows or your antivirus. Please work through any known issues stickied in the comments before reporting your issue.[size=2]\n<br />\n<br />Q: What is the performance impact of using Mod Organizer?\n<br />A: There are no additional disk accesses once the application is running, and CPU impact is minimal. MO2 itself should have minimal memory impact and influence on performance. Before you report performance issues when using MO, please ensure it's not the installed mods causing it!\n<br />The only time the performance impact of MO may be noticeable is during startup while the game is searching for files and routed to the virtualized directories. Once the game is loaded, very little is routed to the VFS.\n<br />\n<br />Q: Can Mod Organizer manage mods that reside outside the data directory (i.e. FXAA/ENB, BOSS, ...)?\n<br />A: No, MO2 is intended to manage mods that are explicitly placed inside your Data directory. Mods that use or override DLL files in the game's main directory are out-of-scope for MO2. However, certain applications, such as script extenders and LOOT, are detected and added automatically to the MO2 launcher. In addition, most tools can be run through MO2 to pick up on the virtualized mods.\n<br />\n<br />Q: How do I find out if MO is working?\n<br />A: Install a mod with a visible impact! Also, check that modorganizer and usvfs logs are created. You can open the log directory through MO2's interface.\n<br />\n<br />Q: I want to uninstall MO, what do I do?\n<br />A: First, inside MO, go to settings and select \"Mod Organizer\" for the load mechanism. Close MO and then just stop using it. If you used the installer, the standard Windows uninstall tool should remove all of the core MO files but will likely leave behind your profiles, mods, and downloads. You can delete the Mod Organizer directory if you're sure you need nothing from it anymore (like mod archives, savegames). If you're using an instanced installation, you may also have a ModOrganizer directory in your Local AppData directory which you can also delete. (Again, be sure you want to delete these directories as they may contain your mod setup, saves, and mod downloads.) Finally, if you moved any of your profile directories in the Mod Organizer settings, those will also need to be deleted separately.\n<br />\n<br />Q: How do I update?\n<br />A: When an newer version of MO is available, an update-icon in MO is activated. Simply click it and follow the on-screen instructions to update. Sometimes, when you first click the update icon, MO will only say it logged in to Nexus but nothing else. In that case, click the icon again.\n<br />If you want to update to a beta version or the update process doesn't work for some reason you can download the update file manually (from the \"update\" category or the \"main\" file if one exists for the newest version) and unpack it to your Mod Organizer directory. If you did this right, you should be asked to overwrite files. Confirm that.\n<br />\n<br />Q: Some mods are shown as having an available update but there is none (or vice versa)\n<br />A: The most likely reason is that the mod author didn't version his mod (or the files of a mod) in a consistent, logical way. It's impossible to account for all of these cases. If a mod is versioned in a nonsensical way, it's up to the author to change the way they version their mods.\n<br />\n<br />Take a close look at the version number: the \"old\" version might be called 0.75.0 and the new one 0.8.0 whereas another mod might be versioned 0.8.0, 0.9.0, 0.10.0 where 0.10.0 is newer than 0.9.0. It's impossible to support both versioning schemes and since the second is more standard and makes more sense, this is what MO supports (75 is bigger than 8).\n<br />\n<br />Some mods may also be versioned 0.9.0, 0.9.0a, 0.9.0b, 0.9.0c, while others may use 'a' to indicate an alpha version and 'b' to indicate a beta. Again, there is no way to support both and since it makes no sense to mix numbered versions AND letters, MO supports alpha/beta markers.\n<br />\n<br />If however you think a mod is versioned correctly and MO is treating it incorrectly, let us know, and always include the mod name. Be aware that in many cases fixing version interpretation for one mod may break it for another, and we will support what makes sense for the most mods.\n<br />\n<br />Q: SkyUI (or some other mod) installer says SKSE is not installed!\n<br />A: Due to the way MO currently works, the installer can't see SKSE. If the installer allows you to continue despite the error (SkyUI does), do that and the mod will work. If the installer doesn't, you have to use a different installation mechanism (i.e. a manual installer). We may attempt to virtualize scripted installers in the future.\n<br />\n<br />Q: The endorsements displayed in MO are different from what the page displays\n<br />A: Please verify you're logging in with the same user credentials in MO and on Nexus. Now \"check for updates\". This should update all endorsement info in MO.\n<br />\n<br />Q: When I download some mods, the download shows a warning sign and it doesn't have version information. \"Query Info\" also doesn't work.\n<br />A: There seems to be a limitation in the Nexus protocol that causes the page to only report 30 files to applications. If a mod has more than that, the newer files aren't visible to MO. To my knowledge this can't be fixed on my end, it has to be fixed by Nexus or the mod author needs to clean out his old files.\n<br />\n<br />Q: Does MO support OMODs?\n<br />A: Not yet\n<br />\n<br />Q: Will you add support for OMODs?\n<br />A: It's something we hope to do before too long\n<br />\n<br />Q: Can I use MO for multiple games?\n<br />A: Yes. You can create a new instance for a new game by pressing the top left button and selecting new instance. An alternative is to simply have a portable instance of MO2 for each game. Be aware that MO2 only allows for one instance to be opened at a time, so you can't have two MO2 processes running at the same time.\n<br />\n<br />Q: The ModOrganizer.log file never gets truncated?\n<br />A: This happens if an application started from MO doesn't get closed. This could be a launcher that sticks around after the game ended. Another good candidate is Steam. If you use a Steam version of your game (includes all versions of Skyrim), please make sure Steam is running before you start the game.\n<br />Also, it is safe to manually delete the log file.\n<br />\n<br />Q: I receive an error along the lines of \"The ordinal xyz could not be located in the dynamic link library LIBEAY32.dll\" or \"QSslSocket: cannot resolve ...\"\n<br />A: This is hopefully resolved on the latest versions of MO2.\n<br />\n<br />Q: I want to report a bug!\n<br />A: Please post issues to the issue tracker at [url=https://github.com/Modorganizer2/modorganizer/issues]https://github.com/Modorganizer2/modorganizer/issues[/url] . Please do include as much relevant information as you can think of and as little irrelevant information as you can. I.e. your OS is relevant if you got a crash but probably not if there is a translation mistake.\n<br />Please check the issue tracker if your bug has been reported before but if you're unsure, feel free to report it anyway, removing incorrect bugs is a lot easier than telephatically learning about issues.\n<br />\n<br />Q: How can I contact you (Tannin)?\n<br />A: If you want to report a bug or request a feature, please go to [url=https://github.com/Modorganizer2/modorganizer/issues]https://github.com/Modorganizer2/modorganizer/issues[/url]\n<br />Otherwise please contact me by private message via nexus or send a mail to sherb at gmx.net\n<br />To contact the MO2 Dev team, you can visit their public discord server [url=https://discord.gg/JdQvBtn]ModOrganizerDevs[/url].[/size][/spoiler]\n<br />\n<br />[size=5][b][center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525731437-2093917414.png[/img]﻿[/center][/b][/size][size=3]Issues, problems and suggestions should be reported to the open discord server: [url=https://discord.gg/5tCqt6V]ModOrganizerDevs[/url] or to the github page (in case they are not user specific): [url=https://github.com/Modorganizer2/modorganizer/issues]Github issues page[/url].\n<br />Discord is also where dev builds are tested, bugs are reported and investigated, suggestions are discussed etc. There is a good number of users there willing to help people with issues in addition to the Developers, so that they don't have to handle everything personally.\n<br />Please don't post issues in the comment section, as monitoring them would be highly inefficient and inconvenient for the developers. Discord and GitHub offer much better and efficient ways to keep track of issues and debug directly with the users that have the problem.[/size][size=2]\n<br />[/size]\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1533671361-1417252071.png[/img]﻿[/center][size=3]Here are some of the themes and splash screens you can use to customize the look and feel of Mod Organizer 2:\n<br />[spoiler]\n<br />[b]INCLUDED THEMES:\n<br />[/b]Paper themes by [url=https://www.nexusmods.com/skyrim/users/6550607]AlcoholSwabs[/url] aka 6788-00 aka Kob\n<br />VS15 theme by [url=https://www.nexusmods.com/skyrim/users/1436683]chintsu_kun[/url]\n<br />Skyim theme by [url=https://www.nexusmods.com/skyrim/users/1436683]chintsu_kun\n<br />[/url]Transparent-Style themes by [url=https://www.nexusmods.com/fallout4/users/29015450]gernash\n<br />[/url]Night Eyes theme (based on paper theme) by ciathyza \n<br />\n<br />[b]GENERIC THEMES:[/b]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/24006]Dark Mode for Mod Organizer 2[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/64439]Paper Themes for Mod Organizer 2 - Light and Dark[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/73273]VS15 Theme for Mod Organizer[/url]\n<br />\n<br />[b]SKYRIM THEMES:[/b]\n<br />[url=https://www.nexusmods.com/skyrim/mods/73817]Skyrim Theme for Mod Organizer[/url]\n<br />\n<br />[b]SKYRIM SPECIAL EDITION THEMES:[/b]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/10634]Splash Themes Mod Organizer...[/url]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/13992]Mod Organizer - The Elder Scrolls V Theme[/url]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/18589]Clean Splash Screens for Mod Organizer 2[/url]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/16675]Mod Organizer Splash screen from dsg77[/url]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/15505]Mod Organizer 2 Splash Screen[/url]\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/19567]Splash Screens for Mod Organizer 2[/url]\n<br />\n<br />[b]FALLOUT 4 THEMES:[/b]\n<br />[url=https://www.nexusmods.com/fallout4/mods/30130]Mod Organizer 2 Splash Screen Project\n<br />\n<br />[/url]All the themes will work whatever game you are managing, not just the ones liste above.\n<br />[/spoiler]\n<br />If you would like your theme/stylesheet/splashscreen to be added to the list contact us on the MO2 Dev discord.[/size]\n<br />[size=5][b][center][/center][/b][/size][b][size=5][center][/center][/size][/b]",
    "picture_url": "https://staticdelivery.nexusmods.com/mods/1704/images/6194/6194-1525726634-1392239594.png",
    "mod_id": 6194,
    "game_id": 1704,
    "allow_rating": true,
    "domain_name": "skyrimspecialedition",
    "category_id": 39,
    "version": "2.2.2.1",
    "endorsement_count": 86936,
    "created_timestamp": 1481783109,
    "created_time": "2016-12-15T06:25:09.000+00:00",
    "updated_timestamp": 1578979235,
    "updated_time": "2020-01-14T05:20:35.000+00:00",
    "author": "Tannin - MO2 Team",
    "uploaded_by": "LePresidente",
    "uploaded_users_profile_url": "http://www.nexusmods.com/games/users/40762840",
    "contains_adult_content": false,
    "status": "published",
    "available": true,
    "user": {
      "member_id": 40762840,
      "member_group_id": 27,
      "name": "LePresidente"
    },
    "endorsement": null
  }
]
